# ========== CLI 工具链 ==========
tap "rtk-ai/tap"

brew "git"
brew "wget"
brew "curl"
brew "jq"
brew "tree"
brew "htop"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "tmux"
brew "uv"
brew "direnv"
brew "lua"
brew "node"
brew "gh"
brew "opencode"
brew "pi-coding-agent"
brew "rtk"

# ========== 桌面应用 ==========
cask "microsoft-edge"
cask "google-chrome"
cask "visual-studio-code"
cask "miniforge"
brew "docker"
brew "docker-compose"
brew "colima"
cask "bitwarden"
cask "codex"
cask "codex-app"
cask "clash-verge-rev"
cask "uuremote"
cask "claude-code"
cask "wechatwork"

# ========== 字体 ==========
cask "font-sf-mono-nerd-font-ligaturized"

# ========== npm CLI ==========
npm "reasonix"
npm "context-mode"

# ========== Python 分析库（通过 pip/uv 安装，不作为 brew 依赖） ==========
# 见 python/requirements-common.txt
