# ========== Tap ==========
tap "rtk-ai/tap"
tap "wangnov/tap"

# ========== CLI 核心 ==========
brew "git"
brew "curl"
brew "jq"
brew "tree"
brew "ripgrep"

# ========== Shell 增强 ==========
brew "fzf"
brew "tmux"
brew "lua"
brew "direnv"
brew "zoxide"
brew "eza"
brew "bat"
brew "yazi"

# ========== 语言 & 运行时 ==========
brew "node"
brew "uv"

# ========== Agent 工具链 ==========
brew "opencode"
brew "pi-coding-agent"
brew "rtk"
brew "codex-threadripper"
brew "gh"
# brew "devpod"  # Not used anymore

# ========== 容器 ==========
# docker + colima 已移除 — 本地不再跑容器，全部走远程堡垒机 (dsliam)
# 需要恢复时：brew install docker colima && colima start && cd docker && docker compose up -d
# brew "docker"
# brew "colima"

# ========== 浏览器 ==========
cask "google-chrome"
cask "microsoft-edge"

# ========== 开发工具 ==========
# Optional fallback editor; no longer installed by default.
# cask "visual-studio-code"
cask "zed"
cask "codex"
cask "codex-app"
cask "claude-code"

# ========== 终端 & 系统增强 ==========
cask "ghostty"
cask "iterm2"
cask "hammerspoon"
# cask "mos"  # 2026-06-15: 卸载 — 罗技G304鼠标卡顿，Mos拦截鼠标输入导致延迟
cask "shottr"
cask "cc-switch"

# ========== 网络 & 安全 ==========
cask "clash-verge-rev"
cask "uuremote"
cask "bitwarden"

# ========== 办公 & 沟通 ==========
cask "wpsoffice"
cask "wechatwork"
cask "obsidian"

# ========== 数据科学 ==========
cask "miniforge"

# ========== 字体 ==========
cask "font-sf-mono-nerd-font-ligaturized"

# ========== npm CLI ==========
npm "reasonix"
npm "context-mode"

# ========== Python 分析库（通过 pip/uv 安装，不作为 brew 依赖） ==========
# 见 python/requirements-common.txt
